export const messageError = {
  session: {
    general: "خطا در پردازش اولیه جلسه کاربری",
  },
  user: {
    general: "خطا در پردازش اولیه کاربر",
    get: "خطا در بازیابی جلسه کاربری",
    update: "خطا در بروز رسانی جلسه کاربری",
    login: "خطا در دریافت حساب کاربری! لطفاً مجدداً تلاش کنید.",
    logout: "خطا در خروج از حساب کاربری",
    create: "خطا در ساخت کاربر",
    password: {
      general: "خطا پردازش کلمه عبور",
      check: "رمز عبور وارد شده اشتباه است",
      notFound: "حساب کاربری شما رمز عبور ندارد",
      update: "عملیات بروز رسانی رمز عبور با خطا مواجه شد",
      email: "خطا در ارسال ایمیل بازیابی کلمه عبور",
    },
  },
  profile: {
    general: "خطا در پردازش حساب کاربری",
    get: "خطا در بازیابی حساب کاربری",
    email: {
      check: "خطا در احراز ایمیل",
      send: "خطا در ارسال ایمیل !لطفاً مجددا تلاش فرمایید",
    },
    phone: {
      check: "خطا در احراز موبایل",
    },
    register: "خطا در ساخت حساب کاربری",
    update: {
      alias: "خطا در بروز رسانی نام حساب کاربری",
      avatar: "خطا در بروز رسانی آواتار حساب کاربری",
      birthdate: "خطا در بروز رسانی تاریخ تولد حساب کاربری",
      gender: "خطا در بروز رسانی جنسیت حساب کاربری",
      email: "خطا در بروز رسانی ایمیل حساب کاربری",
      password: "خطا در بروز رسانی نام پسورد کاربری",
    },
  },
  update: {
    alias: "خطا در بروز رسانی نام حساب کاربری",
    avatar: "خطا در بروز رسانی آواتار حساب کاربری",
    birthdate: "خطا در بروز رسانی تاریخ تولد حساب کاربری",
    gender: "خطا در بروز رسانی جنسیت حساب کاربری",
    email: "خطا در بروز رسانی ایمیل حساب کاربری",
    password: "خطا در بروز رسانی نام پسورد کاربری",
  },
  city: {
    general: "خطا در پردازش اطلاعات شهرها",
    get: "دریافت لیست شهر ها با خطا مواجه شد.",
    selected: {
      get: "عملیات به دست آوردن شهرهای انتخابی شما با خطا مواجه شد",
      update: "خطا در یافتن شهرهای انتخابی",
    },
  },

  statistic: {
    general: "خطا در بارگیری آمار",
  },
  services: {
    get: "دریافت سرویس ها با خطا مواجه شد",
  },
  like: {
    general: "خطا در پردازش بازخورد",
  },
  score: {
    general: "خطا در پردازش امتیاز",
    all: "خطا در دریافت امتیاز",
    mine: "خطا در دریافت امتیاز من",
  },
  payment: {
    general: "عملیات پرداخت با خطا مواجه شد",
    verify: "عملیات احراز پرداخت با خطا یا لغو عملیات روبرو شد",
  },
  rank: {
    general: "خطا در پردازش رتبه",
    get: "خطا در دریافت رتبه",
  },
  notify: {
    general: " فعال سازی اعلان ها با خطا مواجه شد",
  },
  gameHistory: {
    general: "خطا در تاریخچه بازی",
    find: "خطا در یافتن تاریخچه بازی",
  },
  contactUs: {
    general: "پردازش ارتباط با ما با خطا مواجه شد",
    create: "پردازش ثبت درخواست ارتباط با خطا مواجه شد",
  },
};
